database/README.md
```mermaid
erDiagram

    incident_types {
        %% Descibe the type of incident (eg: threat, injury, death...)
        bigint id PK
        varchar(255) label "UNIQUE NOT NULL"
        text description 
        boolean is_active "NOT NULL" DEFAULT true
    }

    incident_targets {
        %% Describe the target of the incident (eg: human, pet, livestock, vehicule, property...)
        bigint id PK
        varchar(255) label "UNIQUE NOT NULL"
        text description
        boolean is_active "NOT NULL" DEFAULT true
    }

    incident_causes {
        %% Describe the cause of the incident (eg: unknown, alcool, drug, age, safety measure non respect, accident, other...)
        bigint id PK
        varchar(255) label "UNIQUE NOT NULL"
        text description
        boolean is_active "NOT NULL" DEFAULT true
    }

    incident_status {
        int Pending_verification "Pending_verification"
        int Verified "Verified"
        int Unverifiable "Unverifiable"
        int Rejected "Rejected"
    }

    incidents {
        bigint id PK
        bigint incident_type_id FK "REFERENCES incident_types(id) ON DELETE RESTRICT NOT NULL"
        bigint incident_target_id FK "REFERENCES incident_targets(id) ON DELETE RESTRICT NOT NULL"
        bigint incident_cause_id FK "REFERENCES incident_causes(id) ON DELETE RESTRICT NOT NULL"
        timestamp_with_time_zone date "NOT NULL"
        varchar(5) zip_code "NOT NULL"
        text title "NOT NULL"
        text description "NOT NULL"
        timestamp_with_time_zone created_at 
        timestamp_with_time_zone updated_at 
        timestamp_with_time_zone deleted_at 
        incident_status incident_status "NOT NULL DEFAULT 'Pending_verification'"
    }

    incidents }|--|| incident_types : ""
    incidents }|--|| incident_targets : ""
    incidents }|--|| incident_causes : ""
    incidents }|--|| incident_status : ""

    incident_sources {
        bigint id PK
        bigint incident_id FK "REFERENCES incidents(id) ON DELETE CASCADE NOT NULL"
        text description
        text source
    }

    incidents ||--o{ incident_sources : ""

    incident_history {
        %% history of the incident report (changes, who created it, when, who validated it, when, who closed it, when, why, how...)
        bigint id PK
        bigint incident_id FK "REFERENCES incidents(id) ON DELETE CASCADE NOT NULL"
        bigint user_id FK "REFERENCES users(id) ON DELETE CASCADE NOT NULL"
        text description
        timestamp_with_time_zone created_at 
    }
    
    incidents ||--o{ incident_history: ""
    incident_history }|--|| users: ""
```
